C2CRIBuildDir/projects/C2C-RI/src/RIGUI/CustomTestSuites/NTCIPExtensionToBlankTestSuite/AppLayer/Data/tmp/TCS-C2CRI-NTCIP2306-WSME-1Sd-SHSP-SSConnect-OC.data

 
#<!--   
#       Title:  TCS-C2CRI-NTCIP2306-WSME-1Sd-SHSP-SSConnect-OC
#       Description:  TCS-C2CRI-NTCIP2306-WSME-1Sd-SHSP-SSConnect-OC
#       Related Procedure:  null
#       Version/Date: 2013/09/13 17:07:44
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the WSDL File to be verified.
WSDLFile = file:/c:/c2cri/testfiles/WSDLFiles/2306TstData1Sd0.wsdl

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Service defined in the WSDL that will be used for Subscription during the test.
SubscriptionServiceName = tmddOCSoapHttpService

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Port defined in the WSDL that is related to the selected Subscription Service Name and will be used during the test.
SubscriptionPortName = tmddOCSoapHttpServicePort

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Operation defined in the WSDL that is related to the selected Subscription Service Name and will be used during the test.
SubscriptionOperationName = OP_DeviceInformationSubscription

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Service defined in the WSDL that will be used for Publication during the test.
PublicationServiceName = tmddECSoapHttpService

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Port defined in the WSDL that is related to the selected Publication Service Name and will be used during the test.
PublicationPortName = tmddECSoapHttpServicePort

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Operation defined in the WSDL that is related to the selected Publication Service Name and will be used during the test.
PublicationOperationName = OP_DeviceInformationUpdate

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
CheckOutcomePassed = true

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous transport exchange is expected during this test. 
TransportErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Transport Error (if applicable) that is expected during this test. 
TransportErrorTypeExpected = No Connection

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the XML message to be sent as a request during this test. 
SubscriptionMessage = <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><c2c:c2cMessageSubscription xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><returnAddress>https://C2CRIEC:8086/SoapTry2/tmddECSoapHttpService/tmddECSoapHttpServicePort/OP_DeviceInformationUpdate</returnAddress><subscriptionAction><subscriptionAction-item>newSubscription</subscriptionAction-item></subscriptionAction><subscriptionType><subscriptionType-item>periodic</subscriptionType-item></subscriptionType><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionTimeFrame><start>2012-09-18T19:18:33</start><end>2014-08-19T13:27:14-04:00</end></subscriptionTimeFrame><subscriptionFrequency>7</subscriptionFrequency><broadcastAlerts><broadcastAlert>broadcastAlertsAccepted</broadcastAlert></broadcastAlerts></c2c:c2cMessageSubscription><mes:deviceInformationRequestMsg xmlns:mes="http://www.tmdd.org/3/messages"><authentication><user-id>string</user-id><password>string</password><operator-id>string</operator-id></authentication><organization-information><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>3</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-information><organization-requesting><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>nad83</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-requesting><device-type>7</device-type><device-information-type>insert-extension-values-here</device-information-type><device-filter><device-id-list><device-id>string</device-id></device-id-list><network-id-list><network-id>string</network-id></network-id-list><link-id-list><link>string</link></link-id-list><link-designator-list><link-designator>string</link-designator></link-designator-list><linear-reference>string</linear-reference><section-id-list><section-id>string</section-id></section-id-list><pattern-id-list><pattern-id>string</pattern-id></pattern-id-list></device-filter></mes:deviceInformationRequestMsg></SOAP-ENV:Body></SOAP-ENV:Envelope>

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous transport exchange is expected during this test. 
SubscriptionTransportErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Transport Error (if applicable) that is expected during this test. 
SubscriptionTransportErrorTypeExpected = NONE

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the XML message to be sent as a request during this test. 
SubscriptionMessage = <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><c2c:c2cMessageSubscription xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><returnAddress>https://C2CRIEC:8086/SoapTry2/tmddECSoapHttpService/tmddECSoapHttpServicePort/OP_DeviceInformationUpdate</returnAddress><subscriptionAction><subscriptionAction-item>newSubscription</subscriptionAction-item></subscriptionAction><subscriptionType><subscriptionType-item>1</subscriptionType-item></subscriptionType><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionTimeFrame><start>2006-09-18T19:18:33</start><end>2014-08-19T13:27:14-04:00</end></subscriptionTimeFrame><subscriptionFrequency>7</subscriptionFrequency><broadcastAlerts><broadcastAlert>broadcastAlertsAccepted</broadcastAlert></broadcastAlerts></c2c:c2cMessageSubscription><mes:deviceInformationRequestMsg xmlns:mes="http://www.tmdd.org/3/messages"><authentication><user-id>string</user-id><password>string</password><operator-id>string</operator-id></authentication><organization-information><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>3</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-information><organization-requesting><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>nad83</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-requesting><device-type>7</device-type><device-information-type>insert-extension-values-here</device-information-type><device-filter><device-id-list><device-id>string</device-id></device-id-list><network-id-list><network-id>string</network-id></network-id-list><link-id-list><link>string</link></link-id-list><link-designator-list><link-designator>string</link-designator></link-designator-list><linear-reference>string</linear-reference><section-id-list><section-id>string</section-id></section-id-list><pattern-id-list><pattern-id>string</pattern-id></pattern-id-list></device-filter></mes:deviceInformationRequestMsg></SOAP-ENV:Body></SOAP-ENV:Envelope>

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous Subscription message is expected during this test. 
SubscriptionMessageErrorExpected = false

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether a Subscription encoding error is expected during this test. 
SubscriptionEncodingErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the Subscription encoding error type that is expected during this test. 
SubscriptionEncodingErrorTypeExpected = NONE

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Subscription message error (if applicable) is expected during this test. 
SubscriptionMessageErrorTypeExpected = NONE

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous transport exchange is expected during the publication dialog of this test. 
PublicationTransportErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Transport Error (if applicable) that is expected during this publication dialog of this test. 
PublicationTransportErrorTypeExpected = NONE

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous Publication message request is expected during this test. 
PublicationMessageErrorExpected = false

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether a Publication encoding error is expected during this test. 
PublicationEncodingErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the Publication encoding error type that is expected during this test. 
PublicationEncodingErrorTypeExpected = NONE

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Publication message error (if applicable) is expected during this test. 
PublicationMessageErrorTypeExpected = NONE



